{
	// Enables the equipment from mobs to be trimmed
	enable_trim_mobs: true,
	// Enables the equipment generated by loot tables to be trimmed
	enable_trim_loot_tables: true,
	// Enables the equipment from villager trades to be trimmed
	enable_trim_trades: true,
	// Blacklist for trim patterns.
	// 
	// This uses regex. This means, if you want to check for a specific pattern, you need to use "^[pattern$]" instead of just "[pattern]".
	// By default, all patterns from the Trimmable Tools mod are blacklisted, since they only work for tools and not armor
	// 
	// To ease the configuration of the blacklist, theres a utils tab inside the config screen, which contains a button to validate the blacklist.
	blacklist: [
		"^tooltrims:.*"
	],
	// Settings for trimming a mob's equipment
	trim_mobs: {
		// Select the system of how to select, what trims to give mobs.
		// - RANDOM_TRIMS: Randomly chooses the trim, while also considering the previous trim of the armor
		// - CUSTOM_TRIM_COMBINATIONS: Chooses the trims for the armor from a list of trim combinations. You can manage the list of trim combinations yourself
		trim_system: "RANDOM_TRIMS",
		// Chance of the mob having no trims at all
		no_trims_chance: 25,
		// Settings for the Random Trims system.
		// These settings will only matter if the RANDOM_TRIMS system is enabled
		random_trims: {
			// Chance of each armor piece from a mob having an armor trim
			trim_chance: 75,
			// Chance of each armor trim applied being similar to the previous armor piece
			similar_trim_chance: 75
		},
		// List of custom trim combinations.
		// 
		// A trim combination consists of a list of allowed armor materials and four trims.
		// The trim combination will only be applied to armor that consists of one of the allowed armor materials.
		// The four trims consist of a helmet trim, a chestplate trim, a leggings trim and a boots trim.
		// You don't need to add the "_armor_trim_smithing_template" suffix of a pattern, it will be added automatically if its needed.
		// 
		// To ease the configuration of trim combinations, theres a utils tab inside the config screen.
		// You can use the buttons inside the tab to reload the config from the config file without having to restart the game and to validate the trim combinations.
		// 
		// Example of a trim combination:
		// {
		//     allowed_armor_materials: ["gold"],
		//     helmet_trim: {material: "diamond", pattern: "silence"},
		//     chestplate_trim: {material: "diamond", pattern: "silence"},
		//     leggings_trim: {material: "netherite_ingot", pattern: "vex"},
		//     boots_trim: {material: "netherite_ingot", pattern: "vex"}
		// },
		trim_combinations: []
	},
	// Settings for trimming equipment generated by loot tables
	trim_loot_tables: {
		// Chance of an item generated by a loot table of having a trim applied
		trim_chance: 50
	},
	// Settings for trimming equipment from villager trades
	trim_trades: {
		// Chance of a villager trade of having a trim applied
		trim_chance: 50,
		// The minimum villager trading level an item needs to be in, to have a chance of being trimmed
		min_level: 3
	}
}